tutorials/dbsFoam/simpleFirstOrderKineticMole/dissolutionWormholing/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

//mu 		mu [1 -1 -1 0 0 0 0] 1e-3;
rho		rho [1 -3 0 0 0 0 0] 1000;
nu              nu [0 2 -1 0 0 0 0] 1e-6;

Di              Di  [0 2 -1 0 0 0 0] 1e-9;


K0 		K0 [0 2 0 0 0 0 0] 1.e-12;


Vm	 	Vm [0 3 0 0 -1 0 0] 36.9e-6;


alpha 		alpha [0  1 -1 0 0 0 0] -1e-3;


A0 		A0 [0 -1 0 0 0 0 0] 1e3;


// ************************************************************************* //


