tutorials/dbsFoam/simpleFirstOrderKineticMole/dissolutionWormholing/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

//mu 		mu [1 -1 -1 0 0 0 0] 1e-3;
rho		rho [1 -3 0 0 0 0 0] 1000;



nu 		nu [ 0 2 -1 0 0 0 0 ] 1e-6;


geochemicalProperties
{
	geochemicalModel simpleFirstOrderKineticMole; 


	rhol    rhol [ 1 -3 0 0 0 0 0 ] 1000;


	mineral (Calcite);

	CalciteProperties
	{

		surfaceAreaModel surfacePowerLaw;
		surfacePowerLawCoeffs
		{
			A0 		A0 [0 -1 0 0 0 0 0] 1e3;
			n 1;
		}

		Vm     Vm   [ 0 3 0 0 -1 0 0 ] 36.9e-6;		// 36.9 cm3/mol
		ki     ki   [0 -2 -1 0 1 0 0] -1; 		//

		Acti   Acti [0 3 0 0 -1 0 0] 1e-3;
		//M      M    [1 0 0 0 -1 0 0] 1e-1;
		rhos   rhos [ 1 -3 0 0 0 0 0 ] 2710;
	}



	absolutePermeabilityModel KozenyCarman;
	KozenyCarmanCoeffs
	{
		K0              K0 [ 0 2 0 0 0 0 0 ] 1e-12;
		updateFromInitialValue off;
	}

	dispersionModel archiesLaw;
	archiesLawCoeffs
	{
		Di   		Di  [0 2 -1 0 0 0 0] 1e-9;
		n 2;	
	}

}




// ************************************************************************* //


