tutorials/dbsFoam/simpleFirstOrderKineticMole/dissolutionWormholing/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(U|UFinal)"
    {
//        solver           smoothSolver;
	solver		PBiCG;
	preconditioner DILU;
        smoother         GaussSeidel;
//		solver	PCG;
//		preconditioner DIC;
        tolerance        1e-09;
        relTol           0.1;
        nSweeps          1;
    }

    "(p|pFinal)"
    {
/*
		solver	PCG;
		preconditioner DIC;
        tolerance        1e-6;
        relTol           0.05;
*/
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.0;
        smoother         DIC; //GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }

    Ci
    {
	solver	PBiCG;
	preconditioner DILU;
        tolerance        1e-6;
        relTol           0.1;
        nSweeps          1;
    }

    CiFinal
    {
	solver	PBiCG;
	preconditioner DILU;
        tolerance        1e-6;
        relTol           0;
        nSweeps          1;
    }


    Ys.CalciteFinal
    {
	solver	diagonal;
        tolerance        1e-6;
        relTol           0;
    }


}


PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 10; //3;
    nCorrectors     2; //2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


relaxationFactors
{
    equations
    {
        ".*"   0.99;
    }
}


// ************************************************************************* /
