tutorials/dbsFoam/simpleFirstOrderKineticMole/dissolutionWormholing/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
    volScalarFieldValue Ys 0.8 
);



regions
(
    cylinderToCell
    {
        p1       (0.0005 0.00025 -10); // start point on cylinder axis
        p2       (0.0005 0.00025 10);   // end point on cylinder axis
        radius   1e-4;
  
        fieldValues
        (
  //          volScalarFieldValue Ys.Calcitefake 0.999
 //  			volScalarFieldValue linkDomainZonesToPhreeqcSol 2 //0.9999
        );
    }

);

// ************************************************************************* //
